{
  "daily": [
    {
      "id": 1,
      "conditions": {
        "temp": "alta",
        "humidity": "baja",
        "rain": "ninguna",
        "uv": "alto"
      },
      "title": "Día cálido y soleado",
      "description": "Hoy se espera un día soleado y caluroso. Ideal para las abejas, pero asegúrate de que tengan suficiente agua.",
      "actions": [
        "Proporciona agua fresca a las colmenas para evitar que las abejas sufran estrés térmico.",
        "Verifica que las abejas no estén sobrecalentadas y asegúrate de que la colmena esté bien ventilada.",
        "Revisa que haya suficiente néctar en las flores cercanas para que las abejas puedan forrajear."
      ]
    },
    {
      "id": 2,
      "conditions": {
        "temp": "baja",
        "humidity": "alta",
        "rain": "ligera",
        "uv": "bajo"
      },
      "title": "Día frío y lluvioso",
      "description": "Se espera lluvia ligera y temperaturas bajas, lo que puede reducir la actividad de las abejas.",
      "actions": [
        "Revisa las colmenas para asegurarte de que las abejas estén protegidas de la humedad.",
        "Si las abejas no pueden salir a forrajear, revisa las reservas de comida y alimenta a las colmenas si es necesario.",
        "Mantén las colmenas protegidas del viento y la lluvia directa."
      ]
    },
    {
      "id": 3,
      "conditions": {
        "temp": "moderada",
        "humidity": "moderada",
        "rain": "ninguna",
        "uv": "moderado"
      },
      "title": "Día templado y seco",
      "description": "Hoy las condiciones son templadas y secas. Es un buen día para realizar una inspección de las colmenas.",
      "actions": [
        "Revisa las colmenas para asegurarte de que las abejas tengan suficiente espacio y alimento.",
        "Verifica que las abejas tengan acceso a agua y que no haya signos de humedad dentro de las colmenas.",
        "Inspecciona las colmenas por posibles plagas o enfermedades."
      ]
    },
    {
      "id": 4,
      "conditions": {
        "temp": "alta",
        "humidity": "moderada",
        "rain": "ninguna",
        "uv": "alto"
      },
      "title": "Día soleado y caluroso",
      "description": "Un día perfecto para las abejas, con mucha luz solar y temperatura elevada. Asegúrate de que las colmenas no se sobrecalienten.",
      "actions": [
        "Proporciona sombra a las colmenas para evitar que se sobrecalienten.",
        "Revise el consumo de agua, ya que las altas temperaturas pueden deshidratar rápidamente a las abejas.",
        "Realiza una inspección para asegurarte de que no haya sobrepoblación dentro de las colmenas."
      ]
    },
    {
      "id": 5,
      "conditions": {
        "temp": "baja",
        "humidity": "alta",
        "rain": "moderada",
        "uv": "bajo"
      },
      "title": "Día frío y nublado",
      "description": "La actividad de las abejas será reducida hoy debido a la baja temperatura y la alta humedad.",
      "actions": [
        "Asegúrate de que las colmenas estén bien protegidas de la humedad y las bajas temperaturas.",
        "Revise las reservas de comida y asegúrate de que las abejas tengan suficientes recursos para el día.",
        "Mantén las colmenas en lugares protegidos del viento y la lluvia."
      ]
    },
    {
      "id": 6,
      "conditions": {
        "temp": "alta",
        "humidity": "alta",
        "rain": "ninguna",
        "uv": "alto"
      },
      "title": "Día caluroso y húmedo",
      "description": "Se espera un día caluroso con alta humedad. Las abejas pueden estar más activas, pero es importante que las colmenas no se sobrecalienten.",
      "actions": [
        "Proporciona sombra adicional a las colmenas para evitar el sobrecalentamiento.",
        "Asegúrate de que las abejas tengan acceso a suficiente agua para regular su temperatura.",
        "Monitorea las colmenas para evitar cualquier signo de estrés por calor o humedad excesiva.",
        "Si es posible, realiza una inspección para ver si las abejas están formando grupos de refresco (abiertas a la entrada de la colmena)."
      ]
    },
    {
      "id": 7,
      "conditions": {
        "temp": "moderada",
        "humidity": "alta",
        "rain": "moderada",
        "uv": "bajo"
      },
      "title": "Día lluvioso y templado",
      "description": "Hoy se espera lluvia moderada con temperaturas templadas. La actividad de las abejas será limitada, por lo que es importante monitorear el bienestar de las colmenas.",
      "actions": [
        "Asegúrate de que las abejas estén protegidas de la humedad dentro de las colmenas.",
        "Verifica las reservas de comida, ya que la lluvia podría dificultar que las abejas forrajeen.",
        "Revisa que las colmenas estén selladas adecuadamente para evitar la entrada de agua.",
        "Mantén las colmenas protegidas del viento y la lluvia para evitar que las abejas sufran estrés."
      ]
    },
    {
      "id": 8,
      "conditions": {
        "temp": "baja",
        "humidity": "alta",
        "rain": "ninguna",
        "uv": "bajo"
      },
      "title": "Día frío y húmedo",
      "description": "Se espera un día frío y húmedo. Las abejas estarán menos activas y es importante asegurarse de que las colmenas estén bien protegidas contra las bajas temperaturas y la humedad.",
      "actions": [
        "Protege las colmenas de la humedad adicional, ya que las bajas temperaturas pueden hacer que la humedad dentro de la colmena sea peligrosa.",
        "Revisa que las abejas tengan suficiente comida almacenada, ya que la falta de actividad por el frío puede afectar el forrajeo.",
        "Mantén las colmenas aisladas del frío y asegúrate de que estén completamente selladas.",
        "Si la humedad es excesiva, considera colocar deshumidificadores o absorventes de humedad en el área alrededor de las colmenas."
      ]
    },
    {
      "id": 9,
      "conditions": {
        "temp": "alta",
        "humidity": "moderada",
        "rain": "ligera",
        "uv": "moderado"
      },
      "title": "Día caluroso y parcialmente nublado",
      "description": "Hoy se espera un día cálido con algo de nubosidad y lluvias ligeras. Asegúrate de que las abejas tengan acceso al néctar y agua.",
      "actions": [
        "Monitorea las reservas de alimento de las abejas, ya que la lluvia ligera podría afectar el acceso a las fuentes de néctar.",
        "Proporciona agua fresca para que las abejas se mantengan hidratadas durante las horas calurosas del día.",
        "Revise las colmenas para asegurarse de que estén bien ventiladas y protegidas de la humedad de la lluvia.",
        "Si las lluvias son breves, permite que las abejas salgan a forrajear tan pronto como sea seguro."
      ]
    },
    {
      "id": 10,
      "conditions": {
        "temp": "baja",
        "humidity": "baja",
        "rain": "ninguna",
        "uv": "alto"
      },
      "title": "Día frío y soleado",
      "description": "Hoy las temperaturas son bajas pero con muchas horas de sol. Las abejas podrían estar menos activas, por lo que es importante monitorear sus reservas.",
      "actions": [
        "Asegúrate de que las abejas tengan suficiente comida dentro de la colmena, ya que el frío puede reducir el acceso a néctar.",
        "Verifica que las colmenas estén protegidas del viento frío y que las abejas no estén expuestas a corrientes de aire.",
        "Si las abejas están inactivas, asegúrate de que la colmena esté aislada adecuadamente para mantener el calor.",
        "Revise las colmenas para asegurarte de que no haya signos de humedad excesiva debido a la combinación de sol y frío."
      ]
    },
    {
      "id": 11,
      "conditions": {
        "temp": "moderada",
        "humidity": "moderada",
        "rain": "moderada",
        "uv": "bajo"
      },
      "title": "Día templado y lluvioso",
      "description": "Hoy se espera lluvia moderada con temperaturas templadas. Las abejas estarán limitadas en sus actividades de forrajeo.",
      "actions": [
        "Protege las colmenas de la lluvia directa y asegúrate de que las abejas puedan permanecer secas dentro de la colmena.",
        "Revisa las reservas de comida de las abejas, ya que no podrán salir a forrajear mientras dure la lluvia.",
        "Verifica que las colmenas estén selladas adecuadamente para evitar filtraciones de agua.",
        "Si la lluvia es constante, considera añadir suplemento alimenticio a las colmenas para asegurarte de que las abejas no se queden sin alimento."
      ]
    }
  ],
  "weekly": [
    {
      "id": 1,
      "title": "Semana cálida y soleada",
      "description": "Se espera que la semana tenga temperaturas cálidas y mucho sol, lo que favorece el forrajeo de las abejas. Es un buen momento para revisar el estado de las colmenas y la disponibilidad de néctar.",
      "actions": [
        "Revisa la cantidad de miel y polen en las colmenas. Si es necesario, agrega más espacio para la puesta de la reina.",
        "Asegúrate de que las abejas tengan acceso a agua fresca, especialmente en los días más calurosos.",
        "Mantén las colmenas ventiladas para evitar el sobrecalentamiento y estrés térmico de las abejas.",
        "Si las temperaturas son muy altas, proporciona sombra a las colmenas para evitar que se sobrecalienten."
      ]
    },
    {
      "id": 2,
      "title": "Semana lluviosa y fresca",
      "description": "Durante esta semana, se prevén lluvias y temperaturas frescas. Este tipo de clima puede reducir la actividad de las abejas y dificultar el forrajeo. Es un buen momento para realizar una inspección profunda de las colmenas.",
      "actions": [
        "Revisa las colmenas para asegurarte de que las abejas estén protegidas de la humedad.",
        "Asegúrate de que las abejas tengan suficiente comida, ya que las lluvias pueden dificultar el acceso al néctar.",
        "Si es necesario, proporciona alimento suplementario, como jarabe de azúcar o pan de abejas, para mantener a la colonia fuerte.",
        "Verifica que las colmenas estén selladas adecuadamente para evitar que entre agua durante las lluvias."
      ]
    },
    {
      "id": 3,
      "title": "Semana fría con nieve",
      "description": "Se esperan temperaturas bajo cero y nieve durante la semana. Las abejas tendrán una actividad reducida, por lo que será necesario monitorear las colmenas con mayor frecuencia para asegurarse de que no sufran de frío o humedad.",
      "actions": [
        "Aísla las colmenas para evitar la pérdida de calor y protegerlas de las nevadas y el frío extremo.",
        "Verifica que las colmenas estén completamente selladas y que no haya corrientes de aire.",
        "Asegúrate de que las colmenas tengan suficiente comida almacenada, ya que las abejas no podrán salir a buscar néctar durante el frío.",
        "Durante las nevadas, revisa las colmenas para asegurarte de que la entrada no se obstruya con nieve o hielo."
      ]
    },
    {
      "id": 4,
      "title": "Semana con tormentas fuertes",
      "description": "Se prevé que la semana esté marcada por tormentas eléctricas y fuertes vientos. Las abejas estarán muy afectadas por este clima, por lo que es crucial tomar medidas preventivas.",
      "actions": [
        "Protege las colmenas de los fuertes vientos y las tormentas asegurándolas bien y colocando refugios adicionales si es posible.",
        "Revisa que las colmenas no tengan filtraciones de agua debido a las lluvias intensas y que las abejas estén protegidas del agua.",
        "Asegúrate de que las abejas no se vean afectadas por los rayos o el granizo cubriendo las colmenas con mallas de protección o tejados improvisados.",
        "Mantén las entradas de las colmenas despejadas para evitar que el agua o el viento las obstruyan."
      ]
    },
    {
      "id": 5,
      "title": "Semana ventosa y templada",
      "description": "La semana se caracteriza por vientos moderados y temperaturas templadas. Aunque las abejas pueden volar en condiciones de viento, es importante asegurarse de que las colmenas estén bien protegidas.",
      "actions": [
        "Revisa que las colmenas estén bien aseguradas y no sean arrastradas por el viento.",
        "Durante los días ventosos, asegúrate de que las abejas no queden atrapadas fuera de la colmena. Protégerlas de las corrientes de aire es crucial.",
        "Monitorea las reservas de miel y polen, ya que el viento puede dificultar el forrajeo.",
        "Si es posible, proporciona refugios adicionales alrededor de las colmenas para reducir el impacto del viento."
      ]
    },
    {
      "id": 6,
      "title": "Semana soleada y cálida con algunas lluvias",
      "description": "Se prevé una semana mayormente soleada con algunas lluvias ligeras. Las abejas estarán activas durante el día, pero es importante monitorear las colmenas para asegurarse de que no se mojen durante la lluvia.",
      "actions": [
        "Asegúrate de que las colmenas tengan suficiente ventilación para evitar la acumulación de humedad.",
        "Si las lluvias son ligeras, permite que las abejas salgan a forrajear cuando sea seguro.",
        "Revisa las reservas de alimento, ya que las lluvias pueden dificultar el forrajeo.",
        "Asegura las colmenas con techos o mallas para protegerlas de la lluvia y el viento."
      ]
    },
    {
      "id": 7,
      "title": "Semana cálida con temperaturas extremas",
      "description": "Esta semana se esperan altas temperaturas, lo que puede generar estrés térmico en las abejas. Es esencial que las colmenas estén bien ventiladas y protegidas del calor extremo.",
      "actions": [
        "Proporciona sombra a las colmenas para evitar que se sobrecalienten.",
        "Verifica que las abejas tengan acceso constante a agua fresca para prevenir la deshidratación.",
        "Monitorea las colmenas para detectar signos de estrés térmico, como la formación de grupos en la entrada.",
        "Si es posible, mueve las colmenas a áreas más frescas durante los días más calurosos."
      ]
    },
    {
      "id": 8,
      "title": "Semana con altas temperaturas y humedad",
      "description": "Se espera una semana calurosa y húmeda, lo que puede afectar la capacidad de las abejas para regular la temperatura dentro de la colmena. Asegúrate de que las colmenas estén protegidas del calor y la humedad excesiva.",
      "actions": [
        "Mantén las colmenas en lugares sombreados y bien ventilados para prevenir el sobrecalentamiento y la acumulación de humedad.",
        "Proporciona agua fresca en abundancia para que las abejas puedan hidratarse.",
        "Verifica el estado de las reservas de miel, ya que la actividad de forrajeo puede reducirse por el calor.",
        "Revisa que no haya signos de moho o acumulación excesiva de humedad dentro de las colmenas."
      ]
    },
    {
      "id": 9,
      "titulo": "Semana templada con noches frescas",
      "description": "Se espera un clima templado durante el día con noches frescas. Las abejas estarán activas durante el día, pero asegúrate de que las colmenas estén protegidas durante las noches más frías.",
      "actions": [
        "Protege las colmenas de las bajas temperaturas nocturnas, cubriéndolas con aislamiento o materiales que retengan el calor.",
        "Verifica las reservas de comida para asegurarte de que las abejas tengan suficiente alimento para el frío nocturno.",
        "Monitorea las entradas de las colmenas para evitar la acumulación de humedad durante las noches frescas.",
        "Asegúrate de que las abejas tengan acceso a agua durante todo el día, ya que el calor puede deshidratarlas rápidamente."
      ]
    },
    {
      "id": 10,
      "title": "Semana con cielos nublados y viento moderado",
      "description": "Se espera una semana con cielos nublados y vientos moderados. Las abejas pueden tener dificultades para forrajear si el viento es fuerte, así que asegúrate de que las colmenas estén bien protegidas.",
      "actions": [
        "Coloca refugios alrededor de las colmenas para protegerlas del viento.",
        "Monitorea las reservas de miel y polen, ya que el viento puede dificultar el forrajeo.",
        "Asegúrate de que las abejas puedan salir a forrajear en los momentos más tranquilos del día.",
        "Revisa las colmenas para asegurarte de que no haya signos de estrés debido a las corrientes de aire."
      ]
    },
    {
      "id": 11,
      "title": "Semana fresca con algunas tormentas eléctricas",
      "description": "Se espera una semana fresca con la posibilidad de tormentas eléctricas. Asegúrate de que las colmenas estén protegidas de la lluvia y el viento durante las tormentas.",
      "actions": [
        "Protege las colmenas de la lluvia y el viento cubriéndolas con techos adicionales o mallas.",
        "Asegúrate de que las abejas tengan suficiente comida en caso de que las tormentas interrumpan el forrajeo.",
        "Verifica que las colmenas no tengan filtraciones de agua debido a las lluvias intensas.",
        "Revisa las entradas de las colmenas para asegurarte de que no se obstruyan con agua o escombros durante las tormentas."
      ]
    },
    {
      "id": 12,
      "title": "Semana cálida con vientos fuertes",
      "description": "Esta semana se espera calor con vientos fuertes, lo que puede dificultar el forrajeo de las abejas. Es esencial proteger las colmenas de los vientos y asegurar su estabilidad.",
      "actions": [
        "Coloca refugios adicionales alrededor de las colmenas para reducir el impacto del viento.",
        "Monitorea la estabilidad de las colmenas para asegurarte de que no se volteen o se desplacen debido al viento.",
        "Asegúrate de que las abejas tengan suficiente agua fresca para hidratarse durante los días calurosos.",
        "Revisa las reservas de comida, ya que los vientos pueden dificultar el acceso al néctar."
      ]
    }
  ]
}