{
  "users": [
    {
      "id": "1",
      "name": "Igor",
      "email": "igor@example.com",
      "password": "contrasena"
    },
    {
      "id": "2",
      "name": "Youssef",
      "email": "youssef@example.com",
      "password": "contrasena"
    },
    {
      "id": "3",
      "name": "Azalfa",
      "email": "azalfa@example.com",
      "password": "contrasena"
    },
    {
      "id": "4",
      "name": "Nerea",
      "email": "nerea@example.com",
      "password": "contrasena"
    },
    {
      "id": "5",
      "name": "Thais",
      "email": "thais@example.com",
      "password": "contrasena"
    },
    {
      "id": "3af3",
      "name": "carlitos",
      "email": "carlitos@abejas.com",
      "password": "abejitas",
      "confirmPassword": "abejitas",
      "provincia": "Ávila",
      "municipio": "Avellaneda",
      "numColmenas": 8,
      "especieAbeja": "Apis mellifera"
    },
    {
      "id": "81bd",
      "name": "marta",
      "email": "marta@abejita.com",
      "password": "calcamonia",
      "confirmPassword": "calcamonia",
      "provincia": "Jaén",
      "municipio": "Baeza",
      "numColmenas": 200,
      "especieAbeja": "Megachile spp."
    },
    {
      "id": "19dd",
      "name": "btrb",
      "email": "martut@abejitaaaa.com",
      "password": "cinturon",
      "confirmPassword": "cinturon",
      "provincia": "Almería",
      "municipio": "Almócita",
      "numColmenas": 433,
      "especieAbeja": "Eucera spp."
    }
  ],
  "news": [
    {
      "id": "1",
      "title": "Descubren una nueva especie de abeja resistente al cambio climático",
      "date": "2024-02-25",
      "description": "Un equipo de investigadores de la Universidad de California ha descubierto en la selva amazónica una nueva especie de abeja con una resistencia excepcional a las temperaturas extremas y a la escasez de alimento. Esta especie, bautizada como Apis resilientis, ha demostrado la capacidad de sobrevivir en climas donde las abejas tradicionales tienen dificultades para prosperar. Según el doctor Michael Larson, líder del estudio, \"esta abeja tiene un metabolismo único que le permite regular su temperatura interna y aprovechar mejor los recursos florales limitados en temporadas de sequía\". Este descubrimiento podría ser clave para el futuro de la apicultura, ya que abre la posibilidad de criar abejas más resistentes a los cambios ambientales y mejorar la producción de miel en zonas afectadas por el calentamiento global. Los científicos ahora trabajan en la cría controlada de esta nueva especie para evaluar su posible integración en la apicultura comercial.",
      "image": "./src/assets/img/news/abeja.jpg"
    },
    {
      "id": "2",
      "title": "Apicultores europeos adoptan inteligencia artificial para mejorar la producción de miel",
      "date": "2024-02-24",
      "description": "En varios países europeos, los apicultores han comenzado a implementar inteligencia artificial (IA) en la gestión de sus colmenas, logrando mejorar la salud de sus abejas y aumentar la producción de miel. La tecnología, basada en sensores y algoritmos de aprendizaje automático, permite monitorear el sonido y los movimientos de las abejas dentro de la colmena. A través del análisis de estos datos, los apicultores pueden detectar signos tempranos de enfermedades, problemas en la alimentación o incluso la posible fuga de la reina. \"Antes, solo podíamos inspeccionar las colmenas manualmente y muchas veces era demasiado tarde cuando descubríamos un problema\", comenta Pierre Lefèvre, un apicultor de Francia que ha incorporado IA en su apiario. \"Ahora, con estos sistemas, recibimos alertas en tiempo real y podemos actuar de inmediato.\" Este avance tecnológico está revolucionando la apicultura y promete hacerla más sostenible y eficiente en los próximos años.",
      "image": "./src/assets/img/news/ia.jpg"
    },
    {
      "id": "3",
      "title": "Primera miel cultivada en laboratorio llega al mercado español",
      "date": "2024-02-24",
      "description": "Una startup española ha logrado desarrollar miel en laboratorio sin la intervención de abejas, utilizando bioingeniería para replicar las propiedades del producto natural. Este innovador desarrollo ya está siendo probado en supermercados de Madrid y Barcelona, generando un intenso debate en el sector apícola.\n\nSegún los creadores de esta miel sintética, el producto ofrece la misma textura, sabor y beneficios nutricionales que la miel convencional, pero sin depender de la producción de las abejas. “Nuestra tecnología permite reducir la presión sobre los polinizadores y garantizar una producción de miel sin variaciones estacionales”, explica Laura Méndez, directora de la empresa.\n\nSin embargo, los apicultores han expresado su preocupación, argumentando que esta alternativa podría afectar la demanda de miel tradicional y reducir el apoyo a la conservación de las abejas.\n\nPor ahora, la miel de laboratorio se comercializa como un complemento, pero expertos creen que podría convertirse en un producto masivo en los próximos años.",
      "image": "./src/assets/img/news/miel.jpg"
    },
    {
      "id": "4",
      "title": "Proyecto global busca reforestar con plantas amigables para las abejas",
      "date": "2024-02-24",
      "description": "Organizaciones ambientales y gobiernos de distintos países han lanzado un proyecto de reforestación con plantas y árboles que favorecen la polinización, con el objetivo de revertir la disminución de la población de abejas en el mundo.\n\nEl plan, bautizado como “Polinizando el Futuro”, tiene como meta sembrar más de 10 millones de árboles y flores silvestres en zonas donde la deforestación ha reducido los recursos para los polinizadores. Entre las especies seleccionadas se encuentran el lavanda, el romero, el girasol y diversas variedades de árboles frutales.\n\n“La falta de hábitats adecuados es una de las principales razones del declive de las abejas”, explica Sofía Hernández, bióloga ambiental. “Con este proyecto, buscamos restaurar ecosistemas y garantizar que las abejas tengan suficiente alimento y refugio”.\n\nSe espera que en los próximos años más países se sumen a la iniciativa, promoviendo políticas de conservación que beneficien tanto a las abejas como a la biodiversidad en general.",
      "image": "./src/assets/img/news/plantas.jpg"
    },
    {
      "id": "5",
      "title": "Robo de colmenas aumenta un 30% en zonas agrícolas",
      "date": "2024-02-24",
      "description": "El robo de colmenas se ha convertido en un grave problema para los apicultores en diversas regiones agrícolas, con un aumento del 30% en los últimos años. Este delito ha sido impulsado por la alta demanda de abejas para la polinización de cultivos y el creciente valor de la miel en el mercado.\n\nEn España, apicultores de Castilla-La Mancha y Andalucía han reportado el robo de cientos de colmenas en los últimos meses. “Nos levantamos un día y nos damos cuenta de que nos han robado 40 o 50 colmenas. Es devastador porque las abejas son nuestro sustento”, lamenta Manuel Ríos, un apicultor afectado.\n\nPara combatir este problema, muchos han comenzado a instalar dispositivos de rastreo GPS en sus colmenas, además de cámaras de seguridad nocturna. Sin embargo, los ladrones han encontrado formas de evadir estas medidas, lo que ha llevado a los apicultores a exigir mayores esfuerzos policiales para frenar esta ola de robos.\n\nLas autoridades ya han comenzado a investigar redes organizadas detrás de estos robos, mientras los apicultores buscan soluciones para proteger su trabajo y el futuro de la apicultura.",
      "image": "./src/assets/img/news/paneles.jpg"
    }
  ],
  "advice": {
    "precipitation": [
      {
        "range": {
          "min": 0,
          "max": 20
        },
        "advice": "No hay riesgo de lluvia, las actividades apícolas pueden continuar normalmente."
      },
      {
        "range": {
          "min": 21,
          "max": 60
        },
        "advice": "Lluvias moderadas, se recomienda revisar las colmenas para evitar filtraciones de agua."
      },
      {
        "range": {
          "min": 61,
          "max": 100
        },
        "advice": "Lluvias intensas, se recomienda proteger las colmenas y monitorear la actividad de las abejas."
      }
    ],
    "snow": [
      {
        "range": {
          "min": 0,
          "max": 500
        },
        "advice": "Bajo riesgo de nieve, actividades normales."
      },
      {
        "range": {
          "min": 501,
          "max": 1000
        },
        "advice": "Riesgo de nieve a bajas altitudes, asegurarse de que las colmenas estén resguardadas."
      },
      {
        "range": {
          "min": 1001,
          "max": 3000
        },
        "advice": "Nieve en altitudes medias, revisar el estado de las colmenas y protegerlas de la nieve."
      }
    ],
    "max_temp": [
      {
        "range": {
          "min": -5,
          "max": 10
        },
        "advice": "Temperaturas frescas, asegurarse de que las colmenas estén bien aisladas."
      },
      {
        "range": {
          "min": 11,
          "max": 25
        },
        "advice": "Temperaturas agradables, las abejas están activas. Asegurarse de que no haya exceso de humedad."
      },
      {
        "range": {
          "min": 26,
          "max": 40
        },
        "advice": "Temperaturas altas, mantener las colmenas ventiladas y evitar que las abejas se sobrecalienten."
      }
    ],
    "min_temp": [
      {
        "range": {
          "min": -10,
          "max": 0
        },
        "advice": "Temperaturas muy frías, asegurarse de que las colmenas estén bien protegidas del frío."
      },
      {
        "range": {
          "min": 1,
          "max": 10
        },
        "advice": "Temperaturas frías, revisar que las colmenas tengan suficiente comida."
      },
      {
        "range": {
          "min": 11,
          "max": 20
        },
        "advice": "Temperaturas moderadas, condiciones favorables para la actividad de las abejas."
      }
    ],
    "max_humidity": [
      {
        "range": {
          "min": 0,
          "max": 60
        },
        "advice": "Humedad baja, mantener las colmenas ventiladas para evitar el exceso de calor."
      },
      {
        "range": {
          "min": 61,
          "max": 80
        },
        "advice": "Humedad moderada, asegurar que las abejas tengan suficiente espacio para ventilación."
      },
      {
        "range": {
          "min": 81,
          "max": 100
        },
        "advice": "Humedad alta, podría haber riesgo de moho o enfermedades en la colmena, revisar con frecuencia."
      }
    ],
    "min_humidity": [
      {
        "range": {
          "min": 0,
          "max": 30
        },
        "advice": "Humedad muy baja, asegurarse de que las abejas no sufran deshidratación."
      },
      {
        "range": {
          "min": 31,
          "max": 50
        },
        "advice": "Humedad moderada, condiciones normales."
      },
      {
        "range": {
          "min": 51,
          "max": 100
        },
        "advice": "Humedad alta, mantener la ventilación para evitar la acumulación de humedad en la colmena."
      }
    ],
    "wind": [
      {
        "range": {
          "min": 0,
          "max": 20
        },
        "advice": "Viento suave, no se esperan problemas para las colmenas."
      },
      {
        "range": {
          "min": 21,
          "max": 40
        },
        "advice": "Viento moderado, asegurarse de que las colmenas estén bien fijadas y no haya riesgo de vuelcos."
      },
      {
        "range": {
          "min": 41,
          "max": 100
        },
        "advice": "Viento fuerte, proteger las colmenas y asegurarse de que no se caigan."
      }
    ],
    "uv_index": [
      {
        "range": {
          "min": 0,
          "max": 2
        },
        "advice": "Bajo índice UV, condiciones normales."
      },
      {
        "range": {
          "min": 3,
          "max": 5
        },
        "advice": "Índice UV moderado, proteger las colmenas de la exposición directa al sol."
      },
      {
        "range": {
          "min": 6,
          "max": 10
        },
        "advice": "Índice UV alto, mantener las colmenas en sombra para evitar que las abejas sufran daños."
      }
    ]
  }
}